# **Leer la base de datos**

In [5]:
import pandas as pd
url = 'https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv'
df = pd.read_csv(url)

df

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero

In [7]:
df.shape

(18, 4)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    18 non-null     object
 1   Edad      18 non-null     int64
 2   Nota      12 non-null     float64
 3   Aprobado  18 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 708.0+ bytes

In [9]:
df['Nombre']

0      Alberto
1          Ana
2       Camila
3        David
4        Brian
5        Bruna
6      Daniela
7       Carlos
8       Alicia
9       Victor
10      Danilo
11     Ignacio
12    Stephany
13      Miriam
14       Pablo
15      Milena
16       Lucas
17       Nadia
Name: Nombre, dtype: object

In [13]:
df[['Edad', 'Nota', 'Aprobado']]

    Edad  Nota   Aprobado
0     20   7.5       True
1     18   NaN      False
2     27   2.5      False
3     18   5.0      False
4     21  10.0       True
5     23   NaN      False
6     21   7.0       True
7     19   6.0      False
8     35   5.6      False
9     28   NaN      False
10    21   NaN      False
11    24   4.5      False
12    26  10.0       True
13    25   9.0       True
14    37   NaN      False
15    29   7.0       True
16    33   NaN      False
17    34   8.0  Verdadero

In [14]:
df.head(7)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   NaN    False
6  Daniela    21   7.0     True

**Extra: Calcula algunas estadísticas descriptivas básicas de los datos en el DataFrame (media, desviación estándar, etc.). Pista: busca el método "describe".**

In [15]:
df.describe()

            Edad       Nota
count  18.000000  12.000000
mean   25.500000   6.841667
std     6.070662   2.264532
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

In [21]:
df.T # Traspuesta las filas en columnas y viceversa

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
Nombre,Alberto,Ana,Camila,David,Brian,Bruna,Daniela,Carlos,Alicia,Victor,Danilo,Ignacio,Stephany,Miriam,Pablo,Milena,Lucas,Nadia
Edad,20,18,27,18,21,23,21,19,35,28,21,24,26,25,37,29,33,34
Nota,7.5,NaN,2.5,5.0,10.0,NaN,7.0,6.0,5.6,NaN,NaN,4.5,10.0,9.0,NaN,7.0,NaN,8.0
Aprobado,True,False,False,False,True,False,True,False,False,False,False,False,True,True,False,True,False,Verdadero

In [23]:
df['Aprobado'].value_counts() # Cuenta los valores únicos en una columna

Aprobado
False        11
True          6
Verdadero     1
Name: count, dtype: int64

In [25]:
df.sort_values(by='Edad', ascending=False) # Ordena el DataFrame por la columna 'Edad' en orden descendente

      Nombre  Edad  Nota   Aprobado
14     Pablo    37   NaN      False
8     Alicia    35   5.6      False
17     Nadia    34   8.0  Verdadero
16     Lucas    33   NaN      False
15    Milena    29   7.0       True
9     Victor    28   NaN      False
2     Camila    27   2.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
11   Ignacio    24   4.5      False
5      Bruna    23   NaN      False
10    Danilo    21   NaN      False
4      Brian    21  10.0       True
6    Daniela    21   7.0       True
0    Alberto    20   7.5       True
7     Carlos    19   6.0      False
1        Ana    18   NaN      False
3      David    18   5.0      False

In [27]:
df.iloc[[0, 2, 4], [1, 3]]  # Selecciona filas y columnas específicas por posición

   Edad Aprobado
0    20     True
2    27    False
4    21     True

In [34]:
df[df['Edad'] < 20]  # Filtra filas donde la edad es menor a 20

   Nombre  Edad  Nota Aprobado
1     Ana    18   NaN    False
3   David    18   5.0    False
7  Carlos    19   6.0    False

In [37]:
df[(df['Edad'] > 20) & (df['Nota'] > 8)]  # Filtra filas donde la edad es mayor a 20 y nota es mayor a 8

      Nombre  Edad  Nota Aprobado
4      Brian    21  10.0     True
12  Stephany    26  10.0     True
13    Miriam    25   9.0     True

In [38]:
df.isna().sum()  # Cuenta los valores nulos en cada columna

Nombre      0
Edad        0
Nota        6
Aprobado    0
dtype: int64

In [40]:
df['Nota'].fillna(8.5)  # Rellena los valores nulos en la columna 'Nota' con 8.5

0      7.5
1      8.5
2      2.5
3      5.0
4     10.0
5      8.5
6      7.0
7      6.0
8      5.6
9      8.5
10     8.5
11     4.5
12    10.0
13     9.0
14     8.5
15     7.0
16     8.5
17     8.0
Name: Nota, dtype: float64

In [41]:
df.isna().sum()  # Verifica nuevamente los valores nulos después de rellenar

Nombre      0
Edad        0
Nota        0
Aprobado    0
dtype: int64